![01](01.png)

https://data.seoul.go.kr/    서울시 청소년 정신건강 통계

![03](02.png)

![nn](04.png)

In [1]:
import pandas as pd

In [4]:
dates = pd.date_range('20190301', periods=7)

In [5]:
dates

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06', '2019-03-07'],
              dtype='datetime64[ns]', freq='D')

In [6]:
import numpy as np

In [8]:
df = pd.DataFrame(np.random.randn(7,4), index=dates, columns=['A','B','C','D'])

In [9]:
df

                   A         B         C         D
2019-03-01  0.784330  0.441504  0.429122  0.110506
2019-03-02 -0.495757 -0.931054  0.802763  2.951850
2019-03-03 -0.769425 -1.199451  0.096371 -0.984801
2019-03-04 -0.966069 -1.938200  0.186021 -0.028864
2019-03-05  0.656659 -0.209208 -0.307459 -1.541756
2019-03-06 -1.571450 -0.431142 -1.235918  0.685504
2019-03-07 -0.724348  0.202534 -0.418308 -1.179392

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.index

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06', '2019-03-07'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.values

array([[ 0.78433029,  0.44150387,  0.42912178,  0.11050588],
       [-0.49575716, -0.93105405,  0.80276299,  2.95184976],
       [-0.7694249 , -1.19945105,  0.09637096, -0.98480058],
       [-0.96606947, -1.9382002 ,  0.18602147, -0.02886443],
       [ 0.65665937, -0.20920812, -0.30745917, -1.54175566],
       [-1.57144987, -0.43114206, -1.2359182 ,  0.68550434],
       [-0.72434777,  0.2025338 , -0.41830821, -1.17939245]])

In [14]:
df.describe()

              A         B         C         D
count  7.000000  7.000000  7.000000  7.000000
mean  -0.440866 -0.580717 -0.063915  0.001864
std    0.861303  0.833380  0.663435  1.523929
min   -1.571450 -1.938200 -1.235918 -1.541756
25%   -0.867747 -1.065253 -0.362884 -1.082097
50%   -0.724348 -0.431142  0.096371 -0.028864
75%    0.080451 -0.003337  0.307572  0.398005
max    0.784330  0.441504  0.802763  2.951850

In [15]:
df.sort_values(by='A')

                   A         B         C         D
2019-03-06 -1.571450 -0.431142 -1.235918  0.685504
2019-03-04 -0.966069 -1.938200  0.186021 -0.028864
2019-03-03 -0.769425 -1.199451  0.096371 -0.984801
2019-03-07 -0.724348  0.202534 -0.418308 -1.179392
2019-03-02 -0.495757 -0.931054  0.802763  2.951850
2019-03-05  0.656659 -0.209208 -0.307459 -1.541756
2019-03-01  0.784330  0.441504  0.429122  0.110506

In [16]:
df.sort_values(by='A', ascending=False)

                   A         B         C         D
2019-03-01  0.784330  0.441504  0.429122  0.110506
2019-03-05  0.656659 -0.209208 -0.307459 -1.541756
2019-03-02 -0.495757 -0.931054  0.802763  2.951850
2019-03-07 -0.724348  0.202534 -0.418308 -1.179392
2019-03-03 -0.769425 -1.199451  0.096371 -0.984801
2019-03-04 -0.966069 -1.938200  0.186021 -0.028864
2019-03-06 -1.571450 -0.431142 -1.235918  0.685504

In [17]:
df['A']

2019-03-01    0.784330
2019-03-02   -0.495757
2019-03-03   -0.769425
2019-03-04   -0.966069
2019-03-05    0.656659
2019-03-06   -1.571450
2019-03-07   -0.724348
Freq: D, Name: A, dtype: float64

In [18]:
type(df['A'])

pandas.core.series.Series

In [21]:
df[0:1]

                  A         B         C         D
2019-03-01  0.78433  0.441504  0.429122  0.110506

In [24]:
df.loc['2019-03-03']

A   -0.769425
B   -1.199451
C    0.096371
D   -0.984801
Name: 2019-03-03 00:00:00, dtype: float64

In [28]:
df.loc['2019-03-01','D']

0.11050587574120277

In [31]:
df.loc['2019-03-01',['A','D']]

A    0.784330
D    0.110506
Name: 2019-03-01 00:00:00, dtype: float64

In [34]:
df.loc['2019-03-01':'2019-03-03',['A','C']]

                   A         C
2019-03-01  0.784330  0.429122
2019-03-02 -0.495757  0.802763
2019-03-03 -0.769425  0.096371

In [37]:
df.loc['2019-03-03':,['A','B']]

                   A         B
2019-03-03 -0.769425 -1.199451
2019-03-04 -0.966069 -1.938200
2019-03-05  0.656659 -0.209208
2019-03-06 -1.571450 -0.431142
2019-03-07 -0.724348  0.202534

In [42]:
df.iloc[:-1]

                   A         B         C         D
2019-03-01  0.784330  0.441504  0.429122  0.110506
2019-03-02 -0.495757 -0.931054  0.802763  2.951850
2019-03-03 -0.769425 -1.199451  0.096371 -0.984801
2019-03-04 -0.966069 -1.938200  0.186021 -0.028864
2019-03-05  0.656659 -0.209208 -0.307459 -1.541756
2019-03-06 -1.571450 -0.431142 -1.235918  0.685504

In [45]:
df.iloc[0:2,:]

                   A         B         C         D
2019-03-01  0.784330  0.441504  0.429122  0.110506
2019-03-02 -0.495757 -0.931054  0.802763  2.951850

In [47]:
df.iloc[[0,1,5],0:2]

                   A         B
2019-03-01  0.784330  0.441504
2019-03-02 -0.495757 -0.931054
2019-03-06 -1.571450 -0.431142

In [48]:
df['A']>0

2019-03-01     True
2019-03-02    False
2019-03-03    False
2019-03-04    False
2019-03-05     True
2019-03-06    False
2019-03-07    False
Freq: D, Name: A, dtype: bool

In [50]:
df

                   A         B         C         D
2019-03-01  0.784330  0.441504  0.429122  0.110506
2019-03-02 -0.495757 -0.931054  0.802763  2.951850
2019-03-03 -0.769425 -1.199451  0.096371 -0.984801
2019-03-04 -0.966069 -1.938200  0.186021 -0.028864
2019-03-05  0.656659 -0.209208 -0.307459 -1.541756
2019-03-06 -1.571450 -0.431142 -1.235918  0.685504
2019-03-07 -0.724348  0.202534 -0.418308 -1.179392

In [49]:
df[df['A']>0]

                   A         B         C         D
2019-03-01  0.784330  0.441504  0.429122  0.110506
2019-03-05  0.656659 -0.209208 -0.307459 -1.541756

In [51]:
df>0

                A      B      C      D
2019-03-01   True   True   True   True
2019-03-02  False  False   True   True
2019-03-03  False  False   True  False
2019-03-04  False  False   True  False
2019-03-05   True  False  False  False
2019-03-06  False  False  False   True
2019-03-07  False   True  False  False

In [52]:
df[df>0]

                   A         B         C         D
2019-03-01  0.784330  0.441504  0.429122  0.110506
2019-03-02       NaN       NaN  0.802763  2.951850
2019-03-03       NaN       NaN  0.096371       NaN
2019-03-04       NaN       NaN  0.186021       NaN
2019-03-05  0.656659       NaN       NaN       NaN
2019-03-06       NaN       NaN       NaN  0.685504
2019-03-07       NaN  0.202534       NaN       NaN

In [53]:
df2 = pd.DataFrame(df, columns=['A','C','D','B'])
df2

                   A         C         D         B
2019-03-01  0.784330  0.429122  0.110506  0.441504
2019-03-02 -0.495757  0.802763  2.951850 -0.931054
2019-03-03 -0.769425  0.096371 -0.984801 -1.199451
2019-03-04 -0.966069  0.186021 -0.028864 -1.938200
2019-03-05  0.656659 -0.307459 -1.541756 -0.209208
2019-03-06 -1.571450 -1.235918  0.685504 -0.431142
2019-03-07 -0.724348 -0.418308 -1.179392  0.202534

In [54]:
df['E'] = np.nan
df

                   A         B         C         D   E
2019-03-01  0.784330  0.441504  0.429122  0.110506 NaN
2019-03-02 -0.495757 -0.931054  0.802763  2.951850 NaN
2019-03-03 -0.769425 -1.199451  0.096371 -0.984801 NaN
2019-03-04 -0.966069 -1.938200  0.186021 -0.028864 NaN
2019-03-05  0.656659 -0.209208 -0.307459 -1.541756 NaN
2019-03-06 -1.571450 -0.431142 -1.235918  0.685504 NaN
2019-03-07 -0.724348  0.202534 -0.418308 -1.179392 NaN

In [55]:
df.loc['2019-03-02','E']=2
df

                   A         B         C         D    E
2019-03-01  0.784330  0.441504  0.429122  0.110506  NaN
2019-03-02 -0.495757 -0.931054  0.802763  2.951850  2.0
2019-03-03 -0.769425 -1.199451  0.096371 -0.984801  NaN
2019-03-04 -0.966069 -1.938200  0.186021 -0.028864  NaN
2019-03-05  0.656659 -0.209208 -0.307459 -1.541756  NaN
2019-03-06 -1.571450 -0.431142 -1.235918  0.685504  NaN
2019-03-07 -0.724348  0.202534 -0.418308 -1.179392  NaN

In [56]:
df['F']=df['A']+df['B']
df

                   A         B         C         D    E         F
2019-03-01  0.784330  0.441504  0.429122  0.110506  NaN  1.225834
2019-03-02 -0.495757 -0.931054  0.802763  2.951850  2.0 -1.426811
2019-03-03 -0.769425 -1.199451  0.096371 -0.984801  NaN -1.968876
2019-03-04 -0.966069 -1.938200  0.186021 -0.028864  NaN -2.904270
2019-03-05  0.656659 -0.209208 -0.307459 -1.541756  NaN  0.447451
2019-03-06 -1.571450 -0.431142 -1.235918  0.685504  NaN -2.002592
2019-03-07 -0.724348  0.202534 -0.418308 -1.179392  NaN -0.521814

In [57]:
!pip install xlrd

Requirement already satisfied: xlrd in c:\programdata\anaconda3\lib\site-packages (1.2.0)

WARNING: You are using pip version 20.3.3; however, version 21.3.1 is available.
You should consider upgrading via the 'c:\programdata\anaconda3\python.exe -m pip install --upgrade pip' command.

In [58]:
pd.read_excel("./data/teen.xls")

,기간,구분,스트레스 인지율,스트레스 인지율.1,스트레스 인지율.2,우울감 경험률,우울감 경험률.1,우울감 경험률.2,자살 생각률,자살 생각률.1,자살 생각률.2
0,기간,구분,전체,남학생,여학생,전체,남학생,여학생,전체,남학생,여학생
1,2020,구분,35.1,29.8,40.8,25.4,21.2,29.9,11.2,8.8,13.8

In [59]:
pd.read_excel("./data/teen.xls", header=1)

     기간 구분     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  2020  구분  35.1  29.8  40.8  25.4   21.2   29.9  11.2    8.8   13.8

In [60]:
pd.read_excel("./data/teen.xls", header=1, usecols="C:K")

     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  35.1  29.8  40.8  25.4   21.2   29.9  11.2    8.8   13.8

In [62]:
col_names=['스트레스', '스트레스남학생', '스트레스여학생', '우울감경험율', '우울남학생', '우울여학생', '자살생각율', '자살남학생','자살여학생']

pd.read_excel("./data/teen.xls", header=1, usecols="C:K", names=col_names)

   스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8

In [63]:
raw_data = pd.read_excel("./data/teen.xls", header=1, usecols="C:K", names=col_names)
raw_data

   스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8

In [64]:
raw_data.loc[1] = 100 - raw_data.loc[0]
raw_data

   스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8
1  64.9     70.2     59.2    74.6   78.8   70.1   88.8   91.2   86.2